Repository: xxshubhamxx/cmux-panecho
Catalog: Packages/Shared/CMUXMobileCore/Sources/CMUXMobileCore/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, zh_hans, zh_hant

# diagnostics.boolean.no
source: No
ar: لا
de: NEIN
fr: Non
ja: いいえ
ko: 아니요
zh_hans: 不
zh_hant: 不

# diagnostics.boolean.yes
source: Yes
ar: نعم
de: Ja
es: Sí
fr: Oui
ja: はい
ko: 예
zh_hans: 是的
zh_hant: 是的

# diagnostics.closeInitiator.localApp
source: Local app
ar: التطبيق المحلي
de: Lokale App
es: aplicación local
fr: Application locale
ja: ローカルアプリ
ko: 로컬 앱
zh_hans: 本地应用程序
zh_hant: 本地應用程式

# diagnostics.closeInitiator.remotePeer
source: Remote peer
ar: النظير البعيد
es: Par remoto
fr: Homologue distant
ja: リモートピア
ko: 원격 피어
zh_hans: 远程对等点
zh_hant: 遠端對等點

# diagnostics.closeInitiator.timedOut
source: Timed out
ar: انتهت المهلة
de: Zeitüberschreitung
es: Tiempo agotado
fr: Délai expiré
ja: タイムアウト
ko: 시간 초과
zh_hans: 超时
zh_hant: 超時

# diagnostics.closeInitiator.unknown
source: Unknown initiator
ar: بادئ غير معروف
de: Unbekannter Initiator
es: Iniciador desconocido
fr: Initiateur inconnu
ja: 不明な開始元
ko: 알 수 없는 개시자
zh_hans: 未知发起者
zh_hant: 未知發起者

# diagnostics.connectionMethod.automatic
source: Auto-Connect (Iroh)
ar: الاتصال التلقائي (Iroh)
de: Automatische Verbindung (Iroh)
es: Conexión automática (Iroh)
fr: Connexion automatique (Iroh)
ja: 自動接続 (Iroh)
ko: 자동 연결(Iroh)
zh_hans: 自动连接（Iroh）
zh_hant: 自動連接（Iroh）

# diagnostics.connectionMethod.tailscale
source: Tailscale Only
ar: مقياس الذيل فقط
de: Nur Tailscale
es: Sólo escala trasera
fr: Queue uniquement
ja: Tailscaleのみ
ko: 테일스케일만
zh_hans: 仅尾鳞片
zh_hant: 僅尾鱗片

# diagnostics.count.bytes
source: %lld bytes
ar: %lld بايت
fr: %lld octets
ja: %lldバイト
ko: %lld바이트
zh_hans: %lld 字节
zh_hant: %lld 位元組

# diagnostics.count.points
source: %lld points
ar: %lld نقطة
de: %lld Punkte
es: %lld puntos
ja: %lldポイント
ko: %lld포인트
zh_hans: %lld 点
zh_hant: %lld 點

# diagnostics.dialLeg.privateFallback
source: Private fallback
ar: التراجع الخاص
de: Privater Fallback
es: Reserva privada
fr: Solution de secours privée
ja: プライベートフォールバック
ko: 비공개 대체
zh_hans: 私人后备
zh_hant: 私人後備

# diagnostics.dialLeg.public
source: Public paths
ar: المسارات العامة
de: Öffentliche Wege
es: Caminos públicos
fr: Voies publiques
ja: 公開経路
ko: 공개 경로
zh_hans: 公共路径
zh_hant: 公共路徑

# diagnostics.duration.fractionalSeconds
source: %@ seconds
ar: %@ ثانية
de: %@ Sekunden
es: %@ segundos
fr: %@ secondes
ja: %@秒
ko: %@ 초

# diagnostics.duration.milliseconds
source: %lld ms
ar: %ll مللي ثانية
ja: %lldミリ秒
zh_hans: %lld 毫秒
zh_hant: %lld 毫秒

# diagnostics.duration.seconds
source: %lld seconds
ar: %lld ثانية
de: %lld Sekunden
es: %lld segundos
fr: %lld secondes
ja: %lld秒
ko: %lld초
zh_hans: %lld 秒
zh_hant: %lld 秒

# diagnostics.event.admissionFailed
source: Client admission failed
ar: فشل قبول العميل
de: Die Client-Zulassung ist fehlgeschlagen
es: Falló la admisión del cliente
fr: L'admission du client a échoué
ja: クライアントの受け入れに失敗しました
ko: 클라이언트 승인 실패
zh_hans: 客户准入失败
zh_hant: 客戶准入失敗

# diagnostics.event.admissionSucceeded
source: Client admitted
ar: اعترف العميل
de: Kunde zugelassen
es: Cliente admitido
fr: Client admis
ja: クライアントを受け入れました
ko: 클라이언트가 승인됨
zh_hans: 客户承认
zh_hant: 客戶承認

# diagnostics.event.appFeatureAction
source: App feature event
ar: حدث ميزة التطبيق
es: Evento de función de la aplicación
fr: Événement de fonctionnalité d'application
ja: アプリ機能イベント
ko: 앱 기능 이벤트
zh_hans: 应用功能事件
zh_hant: 應用程式功能事件

# diagnostics.event.appLifecycleChanged
source: App lifecycle changed
ar: تغيرت دورة حياة التطبيق
de: App-Lebenszyklus geändert
es: El ciclo de vida de la aplicación cambió
fr: Le cycle de vie des applications a changé
ja: アプリのライフサイクルが変更されました
ko: 앱 수명 주기가 변경됨
zh_hans: 应用程序生命周期已更改
zh_hant: 應用程式生命週期已更改

# diagnostics.event.byteGap
source: Terminal byte gap detected
ar: تم اكتشاف فجوة البايت الطرفية
de: Terminal-Byte-Lücke erkannt
es: Se detectó una brecha de bytes en el terminal
fr: Écart d'octets du terminal détecté
ja: ターミナルのバイト欠落を検出しました
ko: 터미널 바이트 간격이 감지되었습니다.
zh_hans: 检测到终端字节间隙
zh_hant: 偵測到終端位元組間隙

# diagnostics.event.composerActiveTransition
source: Composer activation changed
ar: تم تغيير تفعيل الملحن
de: Composer-Aktivierung geändert
es: La activación del compositor cambió
fr: L'activation du compositeur a été modifiée
ja: コンポーザーのアクティブ状態が変更されました
ko: 작성기 활성화가 변경됨
zh_hans: 作曲家激活已更改
zh_hant: 作曲家啟動已更改

# diagnostics.event.composerFieldFocusChanged
source: Composer focus changed
ar: تغير تركيز الملحن
de: Der Fokus des Komponisten hat sich geändert
es: El enfoque del compositor cambió
fr: L'orientation du compositeur a changé
ja: コンポーザーのフォーカスが変更されました
ko: 작곡가 초점이 변경됨
zh_hans: 作曲家焦点发生变化
zh_hant: 作曲家焦點發生變化

# diagnostics.event.composerInputTextChanged
source: Composer draft changed
ar: تم تغيير مسودة الملحن
de: Komponistenentwurf geändert
es: Borrador del compositor cambiado
fr: Le brouillon du compositeur a été modifié
ja: コンポーザーの下書きが変更されました
ko: 작곡가 초안이 변경됨
zh_hans: 作曲家草稿已更改
zh_hant: 作曲家草稿已更改

# diagnostics.event.composerKeyboardToggleWhilePresented
source: Keyboard toggled while composer was open
ar: تم تبديل لوحة المفاتيح أثناء فتح الملحن
de: Die Tastatur wurde umgeschaltet, während Composer geöffnet war
es: Teclado alternado mientras el compositor estaba abierto
fr: Le clavier a basculé pendant que le compositeur était ouvert
ja: コンポーザー表示中にキーボードが切り替わりました
ko: 작성기가 열려 있는 동안 키보드가 전환됨
zh_hans: 作曲家打开时键盘切换
zh_hant: 作曲家開啟時鍵盤切換

# diagnostics.event.composerPresentedChanged
source: Composer visibility changed
ar: تغيرت رؤية الملحن
de: Die Sichtbarkeit des Komponisten wurde geändert
es: La visibilidad del compositor cambió
fr: La visibilité du compositeur a été modifiée
ja: コンポーザーの表示状態が変更されました
ko: 작성자 공개 상태가 변경되었습니다.
zh_hans: 作曲家可见性已更改
zh_hant: 作曲家可見性已更改

# diagnostics.event.composerViewAppear
source: Composer appeared
ar: ظهر الملحن
de: Komponist erschien
es: Apareció el compositor
fr: Le compositeur est apparu
ja: コンポーザーが表示されました
ko: 작곡가 등장
zh_hans: 作曲家出现
zh_hant: 作曲家出現

# diagnostics.event.composerViewDisappear
source: Composer disappeared
ar: اختفى الملحن
de: Der Komponist ist verschwunden
es: Compositor desaparecido
fr: Compositeur disparu
ja: コンポーザーが閉じられました
ko: 작곡가가 사라졌다
zh_hans: 作曲家失踪了
zh_hant: 作曲家失蹤了

# diagnostics.event.connect
source: Connection attempt started
ar: بدأت محاولة الاتصال
de: Verbindungsversuch gestartet
es: Intento de conexión iniciado
fr: Tentative de connexion démarrée
ja: 接続試行を開始しました
ko: 연결 시도가 시작되었습니다.
zh_hans: 连接尝试已开始
zh_hant: 連線嘗試已開始

# diagnostics.event.discoveryFailed
source: Iroh route discovery failed
ar: فشل اكتشاف طريق Iroh
de: Die Iroh-Routenerkennung ist fehlgeschlagen
es: El descubrimiento de la ruta de Iroh falló
fr: La découverte de l'itinéraire Iroh a échoué
ja: Iroh経路の探索に失敗しました
ko: 이로 경로 검색 실패
zh_hans: Iroh 路由发现失败
zh_hant: Iroh 路由發現失敗

# diagnostics.event.discoveryStarted
source: Iroh route discovery started
ar: بدأ اكتشاف طريق Iroh
de: Die Entdeckung der Iroh-Route hat begonnen
es: Comenzó el descubrimiento de la ruta de Iroh
fr: La découverte de la route Iroh a commencé
ja: Iroh経路の探索を開始しました
ko: 이로 경로 탐색 시작
zh_hans: Iroh 路线发现开始
zh_hant: Iroh 路線發現開始

# diagnostics.event.discoverySucceeded
source: Iroh route discovery succeeded
ar: نجح اكتشاف طريق إيروه
de: Die Entdeckung der Iroh-Route war erfolgreich
es: El descubrimiento de la ruta de Iroh fue exitoso
fr: Découverte de la route Iroh réussie
ja: Iroh経路を検出しました
ko: 이로 경로 발견 성공
zh_hans: Iroh路线发现成功
zh_hant: Iroh路線發現成功

# diagnostics.event.endpointActive
source: Iroh endpoint active
ar: نقطة نهاية Iroh نشطة
de: Iroh-Endpunkt aktiv
es: Punto final de Iroh activo
fr: Point de terminaison Iroh actif
ja: Irohエンドポイントが稼働しました
ko: Iroh 엔드포인트 활성
zh_hans: Iroh 端点活跃
zh_hant: Iroh 端點活躍

# diagnostics.event.endpointFailed
source: Iroh endpoint failed
ar: فشلت نقطة نهاية Iroh
de: Der Iroh-Endpunkt ist fehlgeschlagen
es: El punto final de Iroh falló
fr: Le point de terminaison Iroh a échoué
ja: Irohエンドポイントで障害が発生しました
ko: Iroh 엔드포인트 실패
zh_hans: Iroh 端点失败
zh_hant: Iroh 端點失敗

# diagnostics.event.endpointStarting
source: Iroh endpoint starting
ar: Iroh نقطة النهاية البداية
de: Iroh-Endpunkt beginnt
es: Inicio del punto final de Iroh
fr: Démarrage du point de terminaison Iroh
ja: Irohエンドポイントを起動しています
ko: Iroh 엔드포인트 시작
zh_hans: Iroh 端点开始
zh_hant: Iroh 端點開始

# diagnostics.event.endpointStopped
source: Iroh endpoint stopped
ar: توقفت نقطة النهاية Iroh
de: Iroh-Endpunkt gestoppt
es: Punto final de Iroh detenido
fr: Le point de terminaison Iroh s'est arrêté
ja: Irohエンドポイントが停止しました
ko: Iroh 엔드포인트가 중지되었습니다.
zh_hans: Iroh 端点已停止
zh_hant: Iroh 端點已停止

# diagnostics.event.error
source: Unclassified transport error
ar: خطأ نقل غير مصنف
de: Nicht klassifizierter Transportfehler
es: Error de transporte no clasificado
fr: Erreur de transport non classifiée
ja: 未分類のトランスポートエラー
ko: 분류되지 않은 전송 오류
zh_hans: 未分类的传输错误
zh_hant: 未分類的傳輸錯誤

# diagnostics.event.hostAuthenticated
source: Host authenticated
ar: تمت مصادقة المضيف
de: Host authentifiziert
es: Anfitrión autenticado
fr: Hôte authentifié
ja: ホストを認証しました
ko: 호스트 인증됨
zh_hans: 主机已验证
zh_hant: 主機已驗證

# diagnostics.event.hostAuthenticationFailed
source: Host authentication failed
ar: فشلت مصادقة المضيف
de: Die Host-Authentifizierung ist fehlgeschlagen
es: Error de autenticación del host
fr: L'authentification de l'hôte a échoué
ja: ホストの認証に失敗しました
ko: 호스트 인증 실패
zh_hans: 主机验证失败
zh_hant: 主機驗證失敗

# diagnostics.event.inputSeqBehind
source: Terminal input acknowledgements fell behind
ar: تأخرت إقرارات الإدخال الطرفية
de: Die Eingabebestätigungen des Terminals fielen zurück
es: Los acuses de recibo de entrada del terminal se retrasaron
fr: Les accusés de réception des entrées du terminal ont pris du retard
ja: ターミナル入力の確認応答が遅れました
ko: 터미널 입력 승인이 뒤쳐졌습니다.
zh_hans: 终端输入确认落后
zh_hant: 終端輸入確認落後

# diagnostics.event.lanPublicationState
source: LAN advertisement state changed
ar: تم تغيير حالة إعلان LAN
de: LAN-Ankündigungsstatus geändert
es: El estado del anuncio de LAN cambió
fr: L'état de la publicité LAN a changé
ja: LANアドバタイズ状態が変化しました
ko: LAN 알림 상태가 변경됨
zh_hans: LAN 通告状态已更改
zh_hant: LAN 通告狀態已更改

# diagnostics.event.livenessResubscribe
source: Silent event stream resubscribed
ar: تمت إعادة الاشتراك في بث الحدث الصامت
de: Stream für stille Ereignisse erneut abonniert
es: Se volvió a suscribir la transmisión de eventos silenciosos
fr: Flux d'événements silencieux réabonné
ja: 無通信のイベントストリームを再購読しました
ko: 자동 이벤트 스트림이 다시 구독되었습니다.
zh_hans: 重新订阅静默事件流
zh_hant: 重新訂閱靜默事件流

# diagnostics.event.pairFail
source: Pairing failed
ar: فشل الاقتران
de: Die Kopplung ist fehlgeschlagen
es: El emparejamiento falló
fr: Échec du couplage
ja: ペアリングに失敗しました
ko: 페어링 실패
zh_hans: 配对失败
zh_hant: 配對失敗

# diagnostics.event.pairOk
source: Pairing succeeded
ar: نجح الاقتران
de: Die Kopplung war erfolgreich
es: Emparejamiento exitoso
fr: L'appairage a réussi
ja: ペアリングに成功しました
ko: 페어링 성공
zh_hans: 配对成功
zh_hant: 配對成功

# diagnostics.event.pairUnreachable
source: Pairing skipped while offline
ar: تم تخطي الاقتران أثناء عدم الاتصال بالإنترنت
de: Die Kopplung wurde offline übersprungen
es: Emparejamiento omitido mientras no está conectado
fr: Couplage ignoré en mode hors connexion
ja: オフラインのためペアリングをスキップしました
ko: 오프라인 상태에서 페어링을 건너뛰었습니다.
zh_hans: 离线时跳过配对
zh_hant: 離線時跳過配對

# diagnostics.event.reachabilityChanged
source: Network reachability changed
ar: تغيرت إمكانية الوصول إلى الشبكة
de: Die Erreichbarkeit des Netzwerks hat sich geändert
es: La accesibilidad de la red cambió
fr: L'accessibilité du réseau a été modifiée
ja: ネットワーク到達性が変更されました
ko: 네트워크 연결 가능성이 변경됨
zh_hans: 网络可达性发生变化
zh_hant: 網路可及性發生變化

# diagnostics.event.recoveryFailed
source: Connection recovery failed
ar: فشل استرداد الاتصال
de: Die Wiederherstellung der Verbindung ist fehlgeschlagen
es: La recuperación de la conexión falló
fr: La récupération de la connexion a échoué
ja: 接続の復旧に失敗しました
ko: 연결 복구 실패
zh_hans: 连接恢复失败
zh_hant: 連線恢復失敗

# diagnostics.event.recoveryStarted
source: Connection recovery started
ar: بدأ استرداد الاتصال
de: Die Wiederherstellung der Verbindung wurde gestartet
es: Se inició la recuperación de la conexión.
fr: La récupération de la connexion a commencé
ja: 接続の復旧を開始しました
ko: 연결 복구가 시작되었습니다.
zh_hans: 连接恢复开始
zh_hant: 連線恢復開始

# diagnostics.event.recoverySucceeded
source: Connection recovery succeeded
ar: نجح استرداد الاتصال
de: Die Verbindungswiederherstellung war erfolgreich
es: La recuperación de la conexión fue exitosa
fr: La récupération de la connexion a réussi
ja: 接続が復旧しました
ko: 연결 복구 성공
zh_hans: 连接恢复成功
zh_hant: 連線恢復成功

# diagnostics.event.relayPolicyRefreshFailed
source: Relay policy refresh failed
ar: فشل تحديث سياسة الترحيل
de: Die Aktualisierung der Relay-Richtlinie ist fehlgeschlagen
es: Error al actualizar la política de retransmisión
fr: Échec de l'actualisation de la stratégie de relais
ja: リレーポリシーの更新に失敗しました
ko: 릴레이 정책 새로 고침 실패
zh_hans: 中继策略刷新失败
zh_hant: 中繼策略刷新失敗

# diagnostics.event.relayPolicyRefreshStarted
source: Relay policy refresh started
ar: بدأ تحديث سياسة الترحيل
de: Die Aktualisierung der Relay-Richtlinie wurde gestartet
es: Se inició la actualización de la política de retransmisión
fr: L'actualisation de la stratégie de relais a commencé
ja: リレーポリシーの更新を開始しました
ko: 릴레이 정책 새로고침이 시작되었습니다.
zh_hans: 中继策略刷新开始
zh_hant: 中繼策略刷新開始

# diagnostics.event.relayPolicyRefreshSucceeded
source: Relay policy refreshed
ar: تم تحديث سياسة الترحيل
de: Relay-Richtlinie aktualisiert
es: Política de retransmisión actualizada
fr: Politique de relais actualisée
ja: リレーポリシーを更新しました
ko: 릴레이 정책이 새로 고쳐졌습니다.
zh_hans: 中继策略已刷新
zh_hant: 中繼策略已刷新

# diagnostics.event.renderGridLag
source: Render grid lagged
ar: تقديم الشبكة متخلفة
de: Rendergitter verzögert
es: Renderizar cuadrícula retrasada
fr: Grille de rendu décalée
ja: レンダリンググリッドが遅延しました
ko: 렌더링 그리드가 지연됨
zh_hans: 渲染网格滞后
zh_hant: 渲染網格滯後

# diagnostics.event.retryScheduled
source: Retry scheduled
ar: إعادة المحاولة مجدولة
de: Wiederholung geplant
es: Reintento programado
fr: Nouvelle tentative programmée
ja: 再試行を予約しました
ko: 재시도 예정
zh_hans: 已安排重试
zh_hant: 已安排重試

# diagnostics.event.routeUnavailable
source: No usable transport route
ar: لا يوجد طريق نقل صالح للاستخدام
de: Kein nutzbarer Transportweg
es: Ninguna ruta de transporte utilizable
fr: Aucun itinéraire de transport utilisable
ja: 利用可能なトランスポート経路がありません
ko: 이용 가능한 운송 경로 없음
zh_hans: 没有可用的运输路线
zh_hant: 沒有可用的運輸路線

# diagnostics.event.rpcFailed
source: RPC session failed
ar: فشلت جلسة RPC
de: RPC-Sitzung fehlgeschlagen
es: La sesión RPC falló
fr: La session RPC a échoué
ja: RPCセッションに失敗しました
ko: RPC 세션 실패
zh_hans: RPC 会话失败
zh_hant: RPC 會話失敗

# diagnostics.event.rpcReady
source: RPC session ready
ar: جلسة RPC جاهزة
de: RPC-Sitzung bereit
es: Sesión RPC lista
fr: Session RPC prête
ja: RPCセッションの準備ができました
ko: RPC 세션 준비됨
zh_hans: RPC 会话准备就绪
zh_hant: RPC 會話準備就緒

# diagnostics.event.selectedPathChanged
source: Selected network path changed
ar: تم تغيير مسار الشبكة المحدد
de: Ausgewählter Netzwerkpfad geändert
es: La ruta de red seleccionada cambió
fr: Chemin de réseau sélectionné modifié
ja: 選択中のネットワーク経路が変更されました
ko: 선택한 네트워크 경로가 변경됨
zh_hans: 选定的网络路径已更改
zh_hant: 選定的網路路徑已更改

# diagnostics.event.sessionClosed
source: Transport session closed
ar: جلسة النقل مغلقة
de: Transportsitzung geschlossen
es: Sesión de transporte cerrada
fr: Séance de transport fermée
ja: トランスポートセッションが閉じました
ko: 운송 세션이 종료되었습니다.
zh_hans: 交通会议结束
zh_hant: 交通會議結束

# diagnostics.event.streamEnded
source: Event stream ended
ar: انتهى بث الحدث
de: Der Ereignisstrom wurde beendet
es: La transmisión del evento finalizó
fr: Flux d'événements terminé
ja: イベントストリームが終了しました
ko: 이벤트 스트림이 종료되었습니다.
zh_hans: 事件流结束
zh_hant: 事件流結束

# diagnostics.event.transportCloseAttribution
source: Transport close attributed
ar: النقل وثيق المنسوبة
de: Transport nah zugeschrieben
es: Transporte cercano atribuido
fr: Fermeture de transport attribuée
ja: トランスポート切断の原因を特定しました
ko: 운송이 종료된 것으로 간주됨
zh_hans: 运输密切归因
zh_hant: 運輸密切歸因

# diagnostics.event.transportDialConnected
source: Transport connected
ar: النقل متصل
de: Transport verbunden
es: Transporte conectado
fr: Transports connectés
ja: トランスポートに接続しました
ko: 운송 연결됨
zh_hans: 交通连接
zh_hant: 交通連接

# diagnostics.event.transportDialFailed
source: Transport dial failed
ar: فشل طلب النقل
de: Transportwahl fehlgeschlagen
es: Error en la marcación de transporte
fr: Échec du cadran de transport
ja: トランスポートへのダイヤルに失敗しました
ko: 전송 다이얼 실패
zh_hans: 传输拨号失败
zh_hant: 傳輸撥號失敗

# diagnostics.event.transportDialLegFailed
source: Direct dial leg failed
ar: فشلت ساق الاتصال المباشر
de: Der Direktwahlzweig ist fehlgeschlagen
es: Error en el tramo de marcación directa
fr: Échec de la branche de numérotation directe
ja: 直接ダイヤル経路が失敗しました
ko: 직접 다이얼 다리 실패
zh_hans: 直拨支线失败
zh_hant: 直撥支線失敗

# diagnostics.event.transportDialLegSucceeded
source: Direct dial leg connected
ar: ساق الاتصال المباشر متصلة
de: Direktwahlzweig angeschlossen
es: Pierna de marcación directa conectada
fr: Branche de numérotation directe connectée
ja: 直接ダイヤル経路が接続しました
ko: 다이렉트 다이얼 다리 연결됨
zh_hans: 直拨支线已连接
zh_hant: 直撥支線已連接

# diagnostics.event.transportDialPlanBuilt
source: Direct dial plan assembled
ar: تم تجميع خطة الاتصال المباشر
de: Durchwahlplan zusammengestellt
es: Plan de marcación directa ensamblado
fr: Plan de numérotation directe assemblé
ja: 直接ダイヤルプランを作成しました
ko: 직접 전화 걸기 계획이 구성되었습니다.
zh_hans: 直拨方案组装
zh_hant: 直撥方案組裝

# diagnostics.event.transportDialStarted
source: Transport dial started
ar: بدأ الاتصال الهاتفي النقل
de: Transportwahl gestartet
es: Se inició el dial de transporte
fr: Cadran de transport démarré
ja: トランスポートへのダイヤルを開始しました
ko: 전송 다이얼이 시작됨
zh_hans: 传输拨号已启动
zh_hant: 傳輸撥號已啟動

# diagnostics.event.transportLANDiscovery
source: LAN discovery resolved
ar: تم حل اكتشاف الشبكة المحلية
de: LAN-Erkennung behoben
es: Descubrimiento de LAN resuelto
fr: Découverte du réseau local résolue
ja: LAN探索が完了しました
ko: LAN 검색이 해결되었습니다.
zh_hans: LAN 发现已解决
zh_hant: LAN 發現已解決

# diagnostics.event.transportPathEvent
source: Transport path changed
ar: تم تغيير مسار النقل
de: Transportweg geändert
es: La ruta de transporte cambió
fr: Voie de transport modifiée
ja: トランスポート経路が変更されました
ko: 운송 경로가 변경되었습니다.
zh_hans: 运输路径改变
zh_hant: 運輸路徑改變

# diagnostics.event.transportPrivateAddressJoin
source: Private addresses joined broker port
ar: انضمت العناوين الخاصة إلى منفذ الوسيط
de: Private Adressen sind dem Broker-Port beigetreten
es: Direcciones privadas unidas al puerto del corredor
fr: Adresses privées rejointes par le port du courtier
ja: プライベートアドレスをブローカーのポートと結合しました
ko: 개인 주소가 브로커 포트에 합류했습니다.
zh_hans: 私有地址加入代理端口
zh_hant: 私人地址加入代理端口

# diagnostics.event.transportSessionLifecycle
source: Transport session state changed
ar: تم تغيير حالة جلسة النقل
de: Status der Transportsitzung geändert
es: El estado de la sesión de transporte cambió
fr: L'état de la session de transport a été modifié
ja: トランスポートセッションの状態が変更されました
ko: 전송 세션 상태가 변경됨
zh_hans: 传输会话状态已更改
zh_hant: 傳輸會話狀態已更改

# diagnostics.failure.accountMismatch
source: Account mismatch
ar: عدم تطابق الحساب
de: Kontokonflikt
es: No coincide la cuenta
fr: Incompatibilité de compte
ja: アカウントが一致しません
ko: 계정 불일치
zh_hans: 账户不匹配
zh_hant: 帳戶不符

# diagnostics.failure.admissionDenied
source: Client admission denied
ar: تم رفض قبول العميل
de: Kundenzulassung verweigert
es: Admisión de cliente denegada
fr: Admission du client refusée
ja: クライアントの受け入れが拒否されました
ko: 클라이언트 입장이 거부되었습니다.
zh_hans: 客户入场被拒绝
zh_hant: 客戶入場被拒絕

# diagnostics.failure.admissionLeaseExpired
source: Admission lease expired
ar: انتهى عقد الإيجار القبول
de: Eintrittsmietvertrag abgelaufen
es: El contrato de admisión expiró
fr: Bail d'admission expiré
ja: 受け入れリースの有効期限が切れました
ko: 입장권 임대가 만료되었습니다
zh_hans: 入场租约到期
zh_hant: 入場租約到期

# diagnostics.failure.admissionRevalidationFailed
source: Admission revalidation failed
ar: فشل إعادة التحقق من القبول
de: Die Verlängerung der Zulassung ist fehlgeschlagen
es: Revalidación de admisión fallida
fr: La revalidation de l'admission a échoué
ja: 受け入れの再検証に失敗しました
ko: 입학 재검증 실패
zh_hans: 入学重新验证失败
zh_hant: 入學重新驗證失敗

# diagnostics.failure.authorizationFailed
source: Authorization failed
ar: فشل التفويض
de: Die Autorisierung ist fehlgeschlagen
es: Autorización fallida
fr: L'autorisation a échoué
ja: 認可に失敗しました
ko: 승인 실패
zh_hans: 授权失败
zh_hant: 授權失敗

# diagnostics.failure.cancelled
source: Cancelled
ar: تم الإلغاء
de: Abgesagt
es: Cancelado
fr: Annulé
ja: キャンセルされました
ko: 취소
zh_hans: 取消
zh_hant: 取消

# diagnostics.failure.connectionClosed
source: Connection closed
ar: تم إغلاق الاتصال
de: Verbindung geschlossen
es: Conexión cerrada
fr: Connexion fermée
ja: 接続が閉じられました
ko: 연결이 종료되었습니다.
zh_hans: 连接已关闭
zh_hant: 連線已關閉

# diagnostics.failure.connectionRefused
source: Connection refused
ar: رفض اتصال
de: Verbindung abgelehnt
es: Conexión rechazada
fr: Connexion rejetée
ja: 接続が拒否されました
ko: 연결이 거부되었습니다.
zh_hans: 连接被拒绝
zh_hant: 連線被拒絕

# diagnostics.failure.credentialUnavailable
source: Credentials unavailable
ar: بيانات الاعتماد غير متوفرة
de: Anmeldeinformationen nicht verfügbar
es: Credenciales no disponibles
fr: Identifiants indisponibles
ja: 認証情報を利用できません
ko: 자격증명을 사용할 수 없습니다.
zh_hans: 凭证不可用
zh_hant: 憑證不可用

# diagnostics.failure.dnsFailed
source: DNS lookup failed
ar: فشل بحث DNS
de: Die DNS-Suche ist fehlgeschlagen
es: La búsqueda de DNS falló
fr: La recherche DNS a échoué
ja: DNS検索に失敗しました
ko: DNS 조회 실패
zh_hans: DNS 查找失败
zh_hant: DNS 查找失敗

# diagnostics.failure.endpointUnavailable
source: Iroh endpoint unavailable
ar: نقطة نهاية Iroh غير متاحة
de: Iroh-Endpunkt nicht verfügbar
es: Punto final de Iroh no disponible
fr: Point de terminaison Iroh indisponible
ja: Irohエンドポイントを利用できません
ko: Iroh 엔드포인트를 사용할 수 없음
zh_hans: Iroh 端点不可用
zh_hant: Iroh 端點不可用

# diagnostics.failure.hostUnreachable
source: Host unreachable
ar: المضيف غير قابل للوصول
de: Host nicht erreichbar
es: Anfitrión inalcanzable
fr: Hôte inaccessible
ja: ホストに到達できません
ko: 호스트에 연결할 수 없음
zh_hans: 主机无法访问
zh_hant: 主機無法存取

# diagnostics.failure.identityMismatch
source: Host identity mismatch
ar: عدم تطابق هوية المضيف
de: Nichtübereinstimmung der Hostidentität
es: La identidad del host no coincide
fr: Incompatibilité d’identité d’hôte
ja: ホストIDが一致しません
ko: 호스트 ID 불일치
zh_hans: 主机身份不匹配
zh_hant: 主機身分不符

# diagnostics.failure.noRoute
source: No route available
ar: لا يوجد طريق متاح
de: Keine Route verfügbar
es: No hay ruta disponible
fr: Aucun itinéraire disponible
ja: 利用可能な経路がありません
ko: 이용 가능한 경로가 없습니다.
zh_hans: 无可用路线
zh_hant: 無可用路線

# diagnostics.failure.none
source: No failure
ar: لا يوجد فشل
de: Kein Misserfolg
es: Sin fracaso
fr: Aucun échec
ja: エラーなし
ko: 실패 없음
zh_hans: 没有失败
zh_hant: 沒有失敗

# diagnostics.failure.offline
source: Offline
ar: غير متصل
es: Desconectado
fr: Hors ligne
ja: オフライン
ko: 오프라인
zh_hans: 离线
zh_hant: 離線

# diagnostics.failure.payloadTooLarge
source: Payload too large
ar: الحمولة كبيرة جدًا
de: Nutzlast zu groß
es: Carga útil demasiado grande
fr: Charge utile trop importante
ja: ペイロードが大きすぎます
ko: 페이로드가 너무 큼
zh_hans: 有效负载太大
zh_hant: 有效負載太大

# diagnostics.failure.permissionDenied
source: Permission denied
ar: تم رفض الإذن
de: Zugriff verweigert
es: Permiso denegado
fr: Autorisation refusée
ja: 権限がありません
ko: 허가가 거부되었습니다
zh_hans: 没有权限
zh_hant: 沒有權限

# diagnostics.failure.policyUnavailable
source: Relay policy unavailable
ar: سياسة الترحيل غير متاحة
de: Relay-Richtlinie nicht verfügbar
es: Política de retransmisión no disponible
fr: Politique de relais indisponible
ja: リレーポリシーを利用できません
ko: 릴레이 정책을 사용할 수 없습니다.
zh_hans: 中继策略不可用
zh_hant: 中繼策略不可用

# diagnostics.failure.protocolViolation
source: Protocol violation
ar: انتهاك البروتوكول
de: Protokollverletzung
es: Violación del protocolo
fr: Violation du protocole
ja: プロトコル違反
ko: 프로토콜 위반
zh_hans: 违反协议
zh_hant: 違反協議

# diagnostics.failure.resourceLimitReached
source: Resource limit reached
ar: تم الوصول إلى الحد الأقصى للموارد
de: Ressourcenlimit erreicht
es: Límite de recursos alcanzado
fr: Limite de ressources atteinte
ja: リソース上限に達しました
ko: 리소스 한도에 도달했습니다.
zh_hans: 达到资源限制
zh_hant: 達到資源限制
